app/controllers/songs_controller.rb

INSERT INTO "songs" ("album", "artist", "created_at", "file", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "title", "tracknum", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    require "mp3info"

    @song = Song.new(params[:song])

    respond_to do |format|
      if @song.save